Amiya200/stm32_water_tank/Core/Src/model_handle.c
#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"
#include "uart_commands.h"
/* =========================
   CONFIG
   ========================= */
#ifndef DRY_ACTIVE_LOW
#define DRY_ACTIVE_LOW 1
#endif

#ifndef DRY_THRESHOLD_V
#define DRY_THRESHOLD_V 0.10f
#endif

/* Global dry-run stop delay (per spec: 30–60s). Adjust as needed. */
#ifndef DRY_STOP_DELAY_SECONDS
#define DRY_STOP_DELAY_SECONDS 30
#endif
#define DRY_PROBE_TIME_MS  5000UL
#define DRY_WAIT_TIME_MS  10000UL

/* Twist: allow initial ON even if sensor shows dry (build pressure) */
#ifndef TWIST_PRIME_SECONDS
#define TWIST_PRIME_SECONDS 5
#endif

/* =========================
   Externals
   ========================= */
extern UART_HandleTypeDef huart1;
extern ADC_Data adcData;
extern RTC_Time_t time;

/* =========================
   Public model state
   ========================= */
volatile uint8_t  motorStatus = 0;

/* Mode trackers */
volatile bool manualActive    = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool searchActive    = false;
volatile bool timerActive     = false;
volatile bool semiAutoActive  = false;

/* Protections */
volatile bool senseDryRun         = false;
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
volatile bool manualOverride      = false;

/* Max runtime protection (2h default) */
static const uint32_t MAX_CONT_RUN_MS = 2UL * 60UL * 60UL * 1000UL;
static bool           maxRunTimerArmed = false;
static uint32_t       maxRunStartTick  = 0;

/* DRY protection timer (delayed stop) */
static bool     dryTimerArmed    = false;
static uint32_t dryStopDeadline  = 0;

/* =========================
   Utilities
   ========================= */

// =====================================================
// RATE-LIMITED STATUS UPDATER to avoid UART spam
// =====================================================
static void Safe_SendStatusPacket(void)
{
    static uint32_t lastSentTick = 0;
    uint32_t now = HAL_GetTick();

    // only allow one send every 3000 ms
    if (now - lastSentTick < 3000) return;

    lastSentTick = now;
    UART_SendStatusPacket();
}


static inline uint32_t now_ms(void) { return HAL_GetTick(); }

static inline void clear_all_modes(void)
{
    manualActive    = false;
    countdownActive = false;
    twistActive     = false;
    searchActive    = false;
    timerActive     = false;
    semiAutoActive  = false;
    manualOverride  = false;
}

void ModelHandle_ResetAll(void)
{
    clear_all_modes();

//    senseDryRun = senseOverLoad = senseOverUnderVolt = senseMaxRunReached = false;
    maxRunTimerArmed = false;
    maxRunStartTick  = 0;
    dryTimerArmed    = false;
    dryStopDeadline  = 0;

    Relay_Set(1, false);
    Relay_Set(2, false);
    Relay_Set(3, false);
    motorStatus = 0;

    LED_ClearAllIntents();
    LED_ApplyIntents();

    // ✅ Initialize defaults moved from compile-time
    memset(timerSlots, 0, sizeof(timerSlots));
    searchSettings.searchActive = false;
    searchSettings.testingGapSeconds = 60;
    searchSettings.dryRunTimeSeconds = 20;
    twistSettings.twistActive = false;
    twistSettings.onDurationSeconds = 20;
    twistSettings.offDurationSeconds = 40;
}

//TimerSlot timerSlots[5];  // define global array
uint32_t ModelHandle_TimeToSeconds(uint8_t hh, uint8_t mm) {
    return ((uint32_t)hh * 3600UL) + ((uint32_t)mm * 60UL);
}
void ModelHandle_SecondsToTime(uint32_t sec, uint8_t* hh, uint8_t* mm) {
    sec %= 24UL * 3600UL;
    if (hh) *hh = (uint8_t)(sec / 3600UL);
    if (mm) *mm = (uint8_t)((sec % 3600UL) / 60UL);
}

/* =========================
   Countdown (basic)
   ========================= */
volatile bool     countdownMode     = true;
volatile uint32_t countdownDuration = 0;

/* ===== Aux burst (Relays 2 & 3 for a fixed time) ===== */
static bool     auxBurstActive     = false;
static uint32_t auxBurstDeadlineMs = 0;

/* Timer slots (RTC based) */
TimerSlot timerSlots[5];
SearchSettings searchSettings;
TwistSettings twistSettings;


/* =========================
   Motor Control
   ========================= */
static inline void motor_apply(bool on)
{
    Relay_Set(1, on);
    motorStatus = on ? 1U : 0U;

    if (on) {
        if (!maxRunTimerArmed) {
            maxRunTimerArmed = true;
            maxRunStartTick  = now_ms();
            Safe_SendStatusPacket();
        }
    } else {
        maxRunTimerArmed = false;
        // When motor turns OFF, cancel pending dry timer
        dryTimerArmed = false;
        dryStopDeadline = 0;
        Safe_SendStatusPacket();
    }
}

static inline void start_motor(void)
{
    motor_apply(true);
    //printf("Relay1 -> %s\r\n", Relay_Get(1) ? "ON" : "OFF");
}
static inline void stop_motor_keep_modes(void)  { motor_apply(false); }

/* Hard OFF: stop and clear every mode flag (used for terminal OFF or external OFF) */
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor_keep_modes();
    ////printf("ALL MODES OFF + MOTOR OFF\r\n");
//    ModelHandle_SaveCurrentStateToEEPROM();
}

/* =========================
   Tank Check (4/5 submerged)
   ========================= */
static bool isTankFull(void)
{
    int submergedCount = 0;
    for (int i = 0; i < 5; i++) {
        if (adcData.voltages[i] < 0.1f) submergedCount++;
    }
    return (submergedCount >= 4);
}

/* ===== Aux burst public API ===== */
void ModelHandle_TriggerAuxBurst(uint16_t seconds)
{
    if (seconds == 0) seconds = 1;
    Relay_Set(2, true);
    Relay_Set(3, true);
    auxBurstActive     = true;
    auxBurstDeadlineMs = HAL_GetTick() + ((uint32_t)seconds * 1000UL);
}
bool ModelHandle_AuxBurstActive(void) { return auxBurstActive; }

/* =========================
   DRY helpers (shared)
   ========================= */
// Dry Run threshold logic based on ADC_CHANNEL_0 (Dry Run sensor)
void ModelHandle_CheckDryRun(void)
{
    float adc_value = adcData.voltages[0];  // Dry sensor channel

