Amiya200/stm32_water_tank/Core/Src/model_handle.c
    // ✅ Define dryRun = true ONLY when ADC is 0 (meaning sensor dry)
    if (adc_value <= 0.01f) {
        senseDryRun = true;   // Water absent → run motor
    } else {
        senseDryRun = false;  // Water present → stop motor
    }
}

// Call this function periodically in the main loop or after ADC readings
void ModelHandle_ProcessDryRun(void) {
    ModelHandle_CheckDryRun();  // Check the dry run status

    // Optionally, print or log the dry run status for debugging
    if (senseDryRun) {
//        printf("Dry Run active\n");
    } else {
//        printf("Dry Run inactive\n");
    }
}

// Handle Dry Run logic within the motor control protections
static void dry_run_protection(void)
{
    uint32_t now = HAL_GetTick();

    if (motorStatus == 1U) {           // Motor is ON
        if (!senseDryRun) {            // ❌ DryRun FALSE → turn OFF after delay
            if (!dryTimerArmed) {
                dryTimerArmed = true;
                dryStopDeadline = now + (uint32_t)DRY_STOP_DELAY_SECONDS * 1000UL;
            } else if ((int32_t)(now - dryStopDeadline) >= 0) {
                ModelHandle_StopAllModesAndMotor();
//                printf("Motor stopped: dryRun FALSE condition.\n");
            }
        } else {                       // ✅ DryRun TRUE → keep motor ON
            dryTimerArmed = false;
            dryStopDeadline = 0;
        }
    } else {
        // Motor OFF → reset timer
        dryTimerArmed = false;
        dryStopDeadline = 0;
    }
}


/* =========================
   SMART DRY-RUN MOTOR HANDLER
   ========================= */
static bool     dryMotorDelayActive = false;
static uint32_t dryMotorRestartTime = 0;
#define DRY_RESTART_DELAY_MS   8000U   // delay before motor auto-restarts (8s)
#define DRY_MOTOR_OFF_DELAY_MS 5000U   // delay before motor auto-stops (5s)

// =====================================================
// SMART DRY-RUN HANDLER (non-destructive to modes)
// =====================================================
// =====================================================
// FINAL SMART DRY-RUN HANDLER (stable, non-flickering)
// =====================================================
//
// Behavior summary:
// 🟢 Motor stays OFF initially
// 🟢 If dry condition persists, motor turns ON for a probe (5s)
// 🔴 If still dry after probe → motor OFF for 10s pause
// 🔁 Then repeats until water detected
// 💧 If water present, motor keeps running normally
// =====================================================
void ModelHandle_SoftDryRunHandler(void)
{
    static enum {
        DRY_STATE_IDLE = 0,      // waiting idle (motor off)
        DRY_STATE_PROBING,       // motor on, checking for water
        DRY_STATE_WAITING,       // motor off, waiting before retry
        DRY_STATE_NORMAL         // normal water present mode
    } dryState = DRY_STATE_IDLE;

    static uint32_t stateDeadlineMs = 0;
    static bool initialized = false;
    uint32_t now = HAL_GetTick();

    // Ensure motor is OFF initially
    if (!initialized) {
        stop_motor_keep_modes();
        dryState = DRY_STATE_IDLE;
        initialized = true;
    }

    // Update sensor reading
    ModelHandle_CheckDryRun(); // senseDryRun == true => water present

    switch (dryState)
    {
        // ---------------------------------------------
        // 1️⃣ IDLE: waiting, motor off. If dry condition persists, start probe.
        // ---------------------------------------------
        case DRY_STATE_IDLE:
            if (!Motor_GetStatus()) stop_motor_keep_modes();

            if (senseDryRun == false) {
                // no water detected → start probing
                start_motor();
                dryState = DRY_STATE_PROBING;
                stateDeadlineMs = now + 5000UL; // probe ON for 5s
            } else {
                // water OK → go to normal
                dryState = DRY_STATE_NORMAL;
            }
            break;

        // ---------------------------------------------
        // 2️⃣ PROBING: motor ON for a few seconds to test
        // ---------------------------------------------
        case DRY_STATE_PROBING:
            if ((int32_t)(now - stateDeadlineMs) >= 0) {
                ModelHandle_CheckDryRun(); // recheck after motor ON

                if (senseDryRun == false) {
                    // still dry → stop and wait before retry
                    stop_motor_keep_modes();
                    dryState = DRY_STATE_WAITING;
                    stateDeadlineMs = now + 10000UL; // wait 10s before retry
                } else {
                    // water found → continue normal
                    dryState = DRY_STATE_NORMAL;
                }
            }
            break;

        // ---------------------------------------------
        // 3️⃣ WAITING: motor off, waiting before next probe
        // ---------------------------------------------
        case DRY_STATE_WAITING:
            if ((int32_t)(now - stateDeadlineMs) >= 0) {
                dryState = DRY_STATE_IDLE; // ready to retry
            }
            break;

        // ---------------------------------------------
        // 4️⃣ NORMAL: motor runs normally while water present
        // ---------------------------------------------
        case DRY_STATE_NORMAL:
            if (!senseDryRun) {
                // water lost suddenly → stop and start dry cycle
                stop_motor_keep_modes();
                dryState = DRY_STATE_WAITING;
                stateDeadlineMs = now + 10000UL; // short cooldown
            } else {
                // ensure motor stays on while water present
                if (!Motor_GetStatus()) start_motor();
            }
            break;
    }
}

// Function to call periodically to process dry run checks and pro




static inline bool dry_raw_is_dry(void)
{
//    float v = adcData.voltages[0];
//    if (DRY_ACTIVE_LOW) return (v < DRY_THRESHOLD_V);
//    else                return (v > DRY_THRESHOLD_V);
}

/* =========================
   Manual Mode
   ========================= */
void ModelHandle_ToggleManual(void)
{
    // toggling manual should dominate and clear other modes
    bool will_on = !manualActive;

    if (will_on) {
        clear_all_modes();
        manualOverride = true;
        manualActive   = true;
        start_motor();
        //printf("Manual ON\r\n");
    } else {
        ModelHandle_StopAllModesAndMotor(); // OFF should clear everything
        //printf("Manual OFF\r\n");
    }
    ModelHandle_SaveCurrentStateToEEPROM();
}

